[{"w":"yard","voice":"/jɑ:d/","vi":[{"text":"danh từ","subs":[{"text":"Iat, thước Anh (bằng 0, 914 mét)"},{"text":"(hàng hải) trục căng buồm to be yard and yard kề sát nhau, sóng nhau (hai chiếc thuyền)","subs":[{"text":"to be yard and yard   kề sát nhau, sóng nhau (hai chiếc thuyền)"}]}]},{"text":"danh từ","subs":[{"text":"sân (có rào xung quanh) back yard sân sau","subs":[{"text":"back yard   sân sau"}]},{"text":"bãi rào (để chăn nuôi)"},{"text":"xưởng; kho shipbuilding yard xưởng đóng tàu","subs":[{"text":"shipbuilding yard   xưởng đóng tàu"},{"text":"contractor's yard   xưởng chứa vật liệu"}]}]},{"text":"ngoại động từ","subs":[{"text":"đưa súc vật vào bãi rào"}]}]},{"w":"yeah","vi":null},{"w":"year","voice":"/jə:/","vi":[{"text":"danh từ","subs":[{"text":"năm in the year 1945 vào năm 1945","subs":[{"text":"in the year 1945   vào năm 1945"},{"text":"in the year one   vào năm đầu công lịch; (nghĩa bóng) ngày xửa ngày xưa"},{"text":"lunar year   năm âm lịch"},{"text":"year after year   nhiều năm ròng"},{"text":"year in year out   suốt năm, cả năm"},{"text":"student in his second year   học sinh đại học năm thứ hai"}]},{"text":"(số nhiều) tuổi to be ten years old lên mười (tuổi)","subs":[{"text":"to be ten years old   lên mười (tuổi)"},{"text":"the weight of years   ảnh hưởng của tuổi tác, tuổi già sức yếu"},{"text":"well on in years   đứng tuổi"},{"text":"advanced in years   già, có tuổi"},{"text":"to die full of years   chết già"},{"text":"old for one's years   già trước tuổi"}]},{"text":"it heaps years on me cái đó làm cho tôi chán lắm; cái đó làm phiền tôi","subs":[{"text":"cái đó làm cho tôi chán lắm; cái đó làm phiền tôi"}]}]}]},{"w":"yell","voice":"/jel/","vi":[{"text":"danh từ","subs":[{"text":"sự kêu la, sự la hét"},{"text":"tiếng la hét, tiếng thét lác; (từ Mỹ,nghĩa Mỹ) tiếng la hò động viên (trong những cuộc thi đấu thể thao...)"}]},{"text":"động từ","subs":[{"text":"kêu la, la hét, thét lác to yell with pain kêu la vì đau đớn","subs":[{"text":"to yell with pain   kêu la vì đau đớn"},{"text":"to yell with laughter   cười rầm lên"},{"text":"to yell out abuses   chửi mắng om sòm"}]}]}]},{"w":"yellow","voice":"/'jelou/","vi":[{"text":"tính từ","subs":[{"text":"vàng to grow (turn, get, become) yellow vàng ra, hoá vàng; úa vàng (lá)","subs":[{"text":"to grow (turn, get, become) yellow   vàng ra, hoá vàng; úa vàng (lá)"}]},{"text":"ghen ghét, ghen tị, đố kỵ, ngờ vực to cast a yellow look at nhìn (ai) bằng con mắt ghen ghét","subs":[{"text":"to cast a yellow look at   nhìn (ai) bằng con mắt ghen ghét"}]},{"text":"(thông tục) nhút nhát, nhát gan"},{"text":"(từ Mỹ,nghĩa Mỹ) vàng; có tính chất giật gân (báo chí)"}]},{"text":"danh từ","subs":[{"text":"màu vàng"},{"text":"bướm vàng"},{"text":"(số nhiều) tính ghen ghét, tính ghen tị, tính đố kỵ"},{"text":"(thông tục) tính nhút nhát, tính nhát gan"},{"text":"(số nhiều) (y học) bệnh vàng da"}]},{"text":"động từ","subs":[{"text":"vàng ra, hoá vàng; nhuốm vàng, nhuộm vàng"}]}]},{"w":"yes","voice":"/jes/","vi":[{"text":"phó từ","subs":[{"text":"vâng, phải, dạ, được, ừ, có, có chứ to say yes or no nói có hoặc không; nói được hay không","subs":[{"text":"to say yes or no   nói có hoặc không; nói được hay không"},{"text":"You didn't see him? - yes I did   anh không thấy nó à? có chứ"}]}]},{"text":"danh từ, số nhiều yeses","subs":[{"text":"tiếng vâng dạ, tiếng ừ phải"}]}]},{"w":"yesterday","voice":"/'jestədi/","vi":[{"text":"phó từ &amp; danh từ","subs":[{"text":"hôm qua yesterday morning sáng hôm sau","subs":[{"text":"yesterday morning   sáng hôm sau"},{"text":"the day before yesterday   hôm kia"},{"text":"yesterday week   tám hôm trước"}]}]}]},{"w":"yet","voice":"/jet/","vi":[{"text":"phó từ","subs":[{"text":"còn, hãy còn, còn nữa we have ten minutes yet chúng ta còn mười phút nữa","subs":[{"text":"we have ten minutes yet   chúng ta còn mười phút nữa"},{"text":"I remember him yet   tôi còn nhớ anh ta"},{"text":"while he was yet asleep   trong khi anh ta còn đang ngủ"},{"text":"there is much yet to do   hãy còn nhiều việc phải làm lắm"},{"text":"you mush work yet harder   anh còn phải làm việc tích cực hơn nữa"},{"text":"I have a yet more important thing to say   tôi còn có một điều quan trọng hơn nữa để nói"}]},{"text":"bây giờ, lúc này can't you tell me yet? bây giờ anh có thể nói với tôi được chưa?","subs":[{"text":"can't you tell me yet?   bây giờ anh có thể nói với tôi được chưa?"},{"text":"we needn't do it just yet   chúng ta chẳng cần làm điều đó lúc này"}]},{"text":"tuy thế, tuy vậy, nhưng mà, mà, song it is strange, yet true thật là kỳ lạ nhưng mà đúng sự thực","subs":[{"text":"it is strange, yet true   thật là kỳ lạ nhưng mà đúng sự thực"},{"text":"I agree with you, but yet I can't consent   tôi đồng ý với anh song tôi không thể nào thoả thuận được"}]},{"text":"dù sao, dù thế nào he will do it yet dù thế nào nữa nó cũng sẽ làm điều đó","subs":[{"text":"he will do it yet   dù thế nào nữa nó cũng sẽ làm điều đó"}]},{"text":"(từ Mỹ,nghĩa Mỹ) vả lại, hơn nữa much yet remains to be said vả lại còn nhiều điều phải nói","subs":[{"text":"much yet remains to be said   vả lại còn nhiều điều phải nói"}]},{"text":"as yet cho đến nay, cho đến bây giờhe has not known our abilities as yet cho đến nay hắn chưa biết khả năng của chúng ta","subs":[{"text":"cho đến nay, cho đến bây giờ he has not known our abilities as yet cho đến nay hắn chưa biết khả năng của chúng ta","subs":[{"text":"he has not known our abilities as yet   cho đến nay hắn chưa biết khả năng của chúng ta"}]}]},{"text":"nor yet mà cũng không","subs":[{"text":"mà cũng không"}]},{"text":"not yet chưa, còn chưahe has not yet finished his task nó chưa làm xong bài","subs":[{"text":"chưa, còn chưa he has not yet finished his task nó chưa làm xong bài","subs":[{"text":"he has not yet finished his task   nó chưa làm xong bài"}]}]}]},{"text":"liên từ","subs":[{"text":"nhưng mà, song, ấy vậy mà, tuy thế, tuy nhiên he worked hard, yet he failed hắn ta làm việc tích cực ấy thế mà lại trượt","subs":[{"text":"he worked hard, yet he failed   hắn ta làm việc tích cực ấy thế mà lại trượt"}]}]}]},{"w":"yield","voice":"/ji:ld/","vi":[{"text":"danh từ","subs":[{"text":"sản lượng, hoa lợi (thửa ruộng); hiệu suất (máy...) in full yield có hiệu suất cao; đang sinh lợi nhiều","subs":[{"text":"in full yield   có hiệu suất cao; đang sinh lợi nhiều"}]},{"text":"(tài chính) lợi nhuận, lợi tức"},{"text":"(kỹ thuật) sự cong, sự oằn"}]},{"text":"ngoại động từ","subs":[{"text":"(nông nghiệp) sản xuất, sản ra, mang lại a tree yields fruit cây sinh ra quả","subs":[{"text":"a tree yields fruit   cây sinh ra quả"},{"text":"this land yields good crops   miếng đất này mang lại thu hoạch tốt"}]},{"text":"(tài chính) sinh lợi to yield 10% sinh lợi 10 qịu nhường lại cho, nhượng lại cho","subs":[{"text":"to yield 10%   sinh lợi 10 qịu nhường lại cho, nhượng lại cho"},{"text":"to yield precedence to   nhường bước cho"},{"text":"to yield submission   chịu khuất phục"},{"text":"to yield consent   bằng lòng"}]},{"text":"chịu thua, chịu nhường to yield a point in a debate chịu thua một điểm trong một cuộc tranh luận","subs":[{"text":"to yield a point in a debate   chịu thua một điểm trong một cuộc tranh luận"}]},{"text":"(quân sự) giao, chuyển giao"}]},{"text":"nội động từ","subs":[{"text":"(nông nghiệp); (tài chính) sinh lợi"},{"text":"đầu hàng, quy phục, hàng phục, khuất phục to be determined never to yield cương quyết không đầu hàng","subs":[{"text":"to be determined never to yield   cương quyết không đầu hàng"},{"text":"to yield to force   khuất phục trước sức mạnh"}]},{"text":"chịu thua, chịu lép, nhường to yield to none chẳng nhường ai, không chịu thua ai","subs":[{"text":"to yield to none   chẳng nhường ai, không chịu thua ai"}]},{"text":"cong, oằn to yield under a weight cong (oằn) dưới sức nặng","subs":[{"text":"to yield under a weight   cong (oằn) dưới sức nặng"}]},{"text":"to yield up bỏto yield oneself up to dấn thân vào","subs":[{"text":"bỏ to yield oneself up to dấn thân vào","subs":[{"text":"to yield oneself up to   dấn thân vào"}]}]},{"text":"to yield up the ghost chết","subs":[{"text":"chết"}]}]}]},{"w":"you","voice":"/ju:/","vi":[{"text":"đại từ","subs":[{"text":"anh, chị, ông, bà, ngài, ngươi, mày; các anh, các chị, các ông, các bà, các ngài, các người, chúng mày you all know that... tất cả các anh đều biết rằng...","subs":[{"text":"you all know that...   tất cả các anh đều biết rằng..."},{"text":"he spoke of you   hắn ta nói về anh"},{"text":"if I were you   nếu tôi là anh"},{"text":"you there what is your name?   anh kia, tên anh là gì?"}]},{"text":"ai, người ta you never can tell ai biết đâu được","subs":[{"text":"you never can tell   ai biết đâu được"}]}]}]},{"w":"young","voice":"/jʌɳ/","vi":[{"text":"tính từ","subs":[{"text":"trẻ, trẻ tuổi, thiếu niên, thanh niên a young man một thanh niên","subs":[{"text":"a young man   một thanh niên"},{"text":"young people   thanh niên"},{"text":"his (her) young woman (man)   người yêu của nó"},{"text":"a young family   gia đình có nhiều con nhỏ"},{"text":"a young person   người đàn bà lạ trẻ tuổi thuộc tầng lớp dưới (trong ngôn ngữ những người ở của các gia đình tư sản quý tộc Anh)"},{"text":"the young person   những người còn non trẻ ngây thơ cần giữ gìn không cho nghe (đọc) những điều tục tĩu"}]},{"text":"non young tree cây non","subs":[{"text":"young tree   cây non"}]},{"text":"(nghĩa bóng) non trẻ, trẻ tuổi a young republic nước cộng hoà trẻ tuổi","subs":[{"text":"a young republic   nước cộng hoà trẻ tuổi"},{"text":"he is young for his age   nó còn non so với tuổi, nó trẻ hơn tuổi"}]},{"text":"(nghĩa bóng) non nớt, mới mẻ, chưa có kinh nghiệm young in mind trí óc còn non nớt","subs":[{"text":"young in mind   trí óc còn non nớt"},{"text":"young in bussiness   chưa có kinh nghiệm kinh doanh"}]},{"text":"(nghĩa bóng) còn sớm, còn ở lúc ban đầu, chưa muộn, chưa quá, chưa già the night is young yet đêm chưa khuya","subs":[{"text":"the night is young yet   đêm chưa khuya"},{"text":"young moon   trăng non"},{"text":"autumn is still young   thu hãy còn đang ở lúc đầu mùa"}]},{"text":"của tuổi trẻ, của thời thanh niên, của thời niên thiếu, (thuộc) thế hệ trẻ young hope hy vọng của tuổi trẻ","subs":[{"text":"young hope   hy vọng của tuổi trẻ"},{"text":"in one's young days   trong thời kỳ thanh xuân, trong lúc tuổi còn trẻ"}]},{"text":"(thông tục) con, nhỏ young Smith thằng Xmít con, cậu Xmít","subs":[{"text":"young Smith   thằng Xmít con, cậu Xmít"}]}]},{"text":"danh từ","subs":[{"text":"thú con, chim con (mới đẻ) with young có chửa (thú)","subs":[{"text":"with young   có chửa (thú)"}]}]}]},{"w":"your","voice":"/jɔ:/","vi":[{"text":"tính từ sở hữu","subs":[{"text":"của anh, của chị, của ngài, của mày; của các anh, của các chị, của các ngài, của chúng mày show me your hands đưa tay anh cho tôi xem","subs":[{"text":"show me your hands   đưa tay anh cho tôi xem"},{"text":"is this your own book?   đây có phải là quyển sách của anh không?"}]}]}]},{"w":"yours","voice":"/jɔ:z/","vi":[{"text":"đại từ sở hữu","subs":[{"text":"cái của anh, cái của chị, cái của ngài, cái của mày; cái của các anh, cái của các chị, cái của các ngài, cái của chúng mày this book is yours quyển sách này là của anh","subs":[{"text":"this book is yours   quyển sách này là của anh"},{"text":"a friend of yours   một trong những người bạn của anh"},{"text":"that is no business of yours   đó không phải là việc của anh, việc đó không quan hệ gì đến anh"},{"text":"you and yours   ông (anh...) và gia đình (tài sản) của ông (anh...)"},{"text":"yours is to hand   thư của anh đã đến tay tôi"},{"text":"what is yours?   (thông tục) còn anh thì uống gì?"}]},{"text":"Yours truly (faithfully, sincerely) bạn chân thành của anh (chị...) (công thức cuối thư)","subs":[{"text":"bạn chân thành của anh (chị...) (công thức cuối thư)"}]}]}]},{"w":"yourself","voice":"/jɔ:'self/","vi":[{"text":"đại từ phản thân (số nhiều yourselves)","subs":[{"text":"tự anh, tự chị, chính anh, chính mày, tự mày, tự mình you mush wash yourself mày phải tắm rửa đi","subs":[{"text":"you mush wash yourself   mày phải tắm rửa đi"},{"text":"you yourself said so; you said so yourself   chính anh đã nói thế"},{"text":"you are not quite yourself today   hôm nay anh không được bình thường"},{"text":"help yourself to some more meat   mời anh xơi thêm thịt"},{"text":"how's yourself?   (từ lóng) còn anh có khoẻ không?"},{"text":"be yourself!   hãy trấn tĩnh lại!"}]},{"text":"[all] by yourself một mìnhfinish it by yourself hãy làm xong cái đó lấy một mìnhyou'll be left by yourself anh bị bỏ lại một mình","subs":[{"text":"một mình finish it by yourself hãy làm xong cái đó lấy một mình","subs":[{"text":"finish it by yourself   hãy làm xong cái đó lấy một mình"},{"text":"you'll be left by yourself   anh bị bỏ lại một mình"}]}]}]}]},{"w":"youth","voice":"/ju:θ/","vi":[{"text":"danh từ","subs":[{"text":"tuổi trẻ, tuổi xuân, tuổi thanh niên, tuổi niên thiếu the days of youth thời kỳ niên thiếu","subs":[{"text":"the days of youth   thời kỳ niên thiếu"},{"text":"from youth upwards   từ lúc còn trẻ, từ nhỏ"},{"text":"the enthusiasm of youth   nhiệt tình của tuổi trẻ"}]},{"text":"(nghĩa bóng) buổi ban đầu; thời non trẻ the youth of civilization buổi ban đầu của nền văn minh","subs":[{"text":"the youth of civilization   buổi ban đầu của nền văn minh"},{"text":"the youth of a nation   thời kỳ non trẻ của một quốc gia"}]},{"text":"thanh niên; tầng lớp thanh niên, lứa tuổi thanh niên a promising youth một thanh niên đầy hứa hẹn","subs":[{"text":"a promising youth   một thanh niên đầy hứa hẹn"},{"text":"a bevy of youths   một đám thanh niên"},{"text":"the youth of one country   lứa tuổi thanh niên của một nước"},{"text":"The Communist Youth League   Đoàn thanh niên cộng sản"},{"text":"The Ho Chi Minh Labour Youth Union   Đoàn thanh niên lao động Hồ Chí Minh"}]}]}]}]